InformationRegisters/НастройкиКлючевыхПоказателейЭффективности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКлючевыхПоказателейЭффективности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьДолгосрочныеГоризонтыОценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьГоризонтКвартал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьГоризонтПолугодие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьГоризонтГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеЗначенияПоказателейЭффективностиПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЗначенияПоказателейЭффективностиПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеЗначенияПоказателейЭффективностиПозиций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЗначенияПоказателейЭффективностиПозиций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеЗначенияПоказателейЭффективностиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЗначенияПоказателейЭффективностиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтруктураЦелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтруктураЦелей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОценкиПоказателяЭффективности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницыШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыГраницыШкалыПоказателяЭффективности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратнаяШкала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВводПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суммируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаЗадаетсяИнтервалом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалОценкиОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалОценкиДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КлючевыеПоказателиЭффективностиСборСтатистики/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Ключевые показатели эффективности";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Настройки ключевых показателей эффективности", СтатистикаНастроек());
	Статистика.Вставить("Структура целей", СтатистикаСтруктурыЦелей());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Журнал = Метаданные.ЖурналыДокументов.ПланПоказателейЭффективности;
	СтатистикаПоДокументам = СборСтатистики.СтандартныеПоказателиПоЖурналу(Журнал, НачалоПериода);
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоДокументам, ВидСтатистики);
	
	Журнал = Метаданные.ЖурналыДокументов.ФактПоказателейЭффективности;
	СтатистикаПоДокументам = СборСтатистики.СтандартныеПоказателиПоЖурналу(Журнал, НачалоПериода);
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоДокументам, ВидСтатистики);
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Плановые значения показателей эффективности подразделений", СтатистикаПодразделений(НачалоПериода));
	Статистика.Вставить("Плановые значения показателей эффективности позиций", СтатистикаПозиций(НачалоПериода));
	Статистика.Вставить("Плановые значения показателей эффективности сотрудников", СтатистикаСотрудников(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиКлючевыхПоказателейЭффективности.ИспользоватьДолгосрочныеГоризонтыОценки КАК ИспользоватьДолгосрочныеГоризонтыОценки,
		|	НастройкиКлючевыхПоказателейЭффективности.ИспользоватьГоризонтКвартал КАК ИспользоватьГоризонтКвартал,
		|	НастройкиКлючевыхПоказателейЭффективности.ИспользоватьГоризонтПолугодие КАК ИспользоватьГоризонтПолугодие,
		|	НастройкиКлючевыхПоказателейЭффективности.ИспользоватьГоризонтГод КАК ИспользоватьГоризонтГод
		|ИЗ
		|	РегистрСведений.НастройкиКлючевыхПоказателейЭффективности КАК НастройкиКлючевыхПоказателейЭффективности";
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие();
	
	Результат = ТаблицаНастроек.ВыгрузитьКолонку("ИспользоватьДолгосрочныеГоризонтыОценки");
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат ПоказателиСтатистики;
	КонецЕсли;
	
	ИспользоватьДолгосрочныеГоризонтыОценки = Число(Результат[0]);
	ПоказателиСтатистики.Вставить("Использовать долгосрочные горизонты оценки", ИспользоватьДолгосрочныеГоризонтыОценки);
	
	Если ИспользоватьДолгосрочныеГоризонтыОценки Тогда
		ИспользоватьГоризонтКвартал = Число(ТаблицаНастроек.ВыгрузитьКолонку("ИспользоватьГоризонтКвартал")[0]);
		ПоказателиСтатистики.Вставить("Использовать горизонт квартал", ИспользоватьГоризонтКвартал);
		
		ИспользоватьГоризонтПолугодие = Число(ТаблицаНастроек.ВыгрузитьКолонку("ИспользоватьГоризонтПолугодие")[0]);
		ПоказателиСтатистики.Вставить("Использовать горизонт полугодие", ИспользоватьГоризонтПолугодие);
		
		ИспользоватьГоризонтГод = Число(ТаблицаНастроек.ВыгрузитьКолонку("ИспользоватьГоризонтГод")[0]);
		ПоказателиСтатистики.Вставить("Использовать горизонт год", ИспользоватьГоризонтГод);
	КонецЕсли;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаСтруктурыЦелей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СтруктураЦелей.Ссылка) КАК Показателей,
		|	СтруктураЦелей.СпособОценки КАК СпособОценки,
		|	СтруктураЦелей.ГраницыШкалы КАК ГраницыШкалы,
		|	СтруктураЦелей.Суммируемый КАК Суммируемый,
		|	СтруктураЦелей.ОбратнаяШкала КАК ОбратнаяШкала
		|ИЗ
		|	Справочник.СтруктураЦелей КАК СтруктураЦелей
		|ГДЕ
		|	СтруктураЦелей.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СтруктураЦелей.СпособОценки,
		|	СтруктураЦелей.ГраницыШкалы,
		|	СтруктураЦелей.Суммируемый,
		|	СтруктураЦелей.ОбратнаяШкала
		|ИТОГИ
		|	СУММА(Показателей)
		|ПО
		|	ОБЩИЕ,
		|	СпособОценки,
		|	ГраницыШкалы,
		|	Суммируемый,
		|	ОбратнаяШкала";
	
	ПоказателиСтатистики = Новый Соответствие;
	ВыборкаВсего = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВсего.Следующий() Цикл
		
		ПоказателиСтатистики.Вставить("Показателей", ВыборкаВсего.Показателей);
		
		ВыборкаСпособОценки = ВыборкаВсего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СпособОценки");
		Пока ВыборкаСпособОценки.Следующий() Цикл
			ПредставлениеПеречисления = Строка(ВыборкаСпособОценки.СпособОценки);
			Если Не ЗначениеЗаполнено(ПредставлениеПеречисления) Тогда
				ПредставлениеПеречисления = "Пустых способов оценки";
			КонецЕсли;
			ПоказателиСтатистики.Вставить(ПредставлениеПеречисления, ВыборкаСпособОценки.Показателей);
		КонецЦикла;
		
		ВыборкаГраницыШкалы = ВыборкаВсего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ГраницыШкалы");
		Пока ВыборкаГраницыШкалы.Следующий() Цикл
			ПредставлениеПеречисления = Строка(ВыборкаГраницыШкалы.ГраницыШкалы);
			Если Не ЗначениеЗаполнено(ПредставлениеПеречисления) Тогда
				ПредставлениеПеречисления = "Пустых границ шкалы";
			КонецЕсли;
			ПоказателиСтатистики.Вставить(ПредставлениеПеречисления, ВыборкаСпособОценки.Показателей);
		КонецЦикла;
		
		ВыборкаСуммируемый = ВыборкаВсего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Суммируемый");
		Пока ВыборкаСуммируемый.Следующий() Цикл
			Если ВыборкаСуммируемый.Суммируемый Тогда
				Ключ = "Суммируемых";
			Иначе
				Ключ = "Не суммируемых";
			КонецЕсли;
			ПоказателиСтатистики.Вставить(Ключ, ВыборкаСуммируемый.Показателей);
		КонецЦикла;
		
		ВыборкаОбратнаяШкала = ВыборкаВсего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбратнаяШкала");
		Пока ВыборкаОбратнаяШкала.Следующий() Цикл
			Если ВыборкаОбратнаяШкала.ОбратнаяШкала Тогда
				Ключ = "Обратных шкал";
			Иначе
				Ключ = "Прямых шкал";
			КонецЕсли;
			ПоказателиСтатистики.Вставить(Ключ, ВыборкаОбратнаяШкала.Показателей);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПодразделений(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение КАК Подразделение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПлановыеЗначенияПоказателейЭффективностиПодразделений.Показатель) КАК КоличествоПоказателей
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений КАК ПлановыеЗначенияПоказателейЭффективностиПодразделений
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия > &НачалоПериода
		|	И ПлановыеЗначенияПоказателейЭффективностиПодразделений.ПериодДействия <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеЗначенияПоказателейЭффективностиПодразделений.Подразделение";
	
	ТаблицаПодразделений = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	
	КоличествоПодразделений = ТаблицаПодразделений.Количество();
	ПоказателейНаОдноПодразделениеВСреднем =
		?(КоличествоПодразделений > 0, ТаблицаПодразделений.Итог("КоличествоПоказателей") / КоличествоПодразделений, 0);
	
	ПоказателиСтатистики.Вставить("Показателей на одно подразделение в среднем", ПоказателейНаОдноПодразделениеВСреднем);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПозиций(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция КАК Позиция,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПлановыеЗначенияПоказателейЭффективностиПозиций.Показатель) КАК КоличествоПоказателей
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций КАК ПлановыеЗначенияПоказателейЭффективностиПозиций
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия > &НачалоПериода
		|	И ПлановыеЗначенияПоказателейЭффективностиПозиций.ПериодДействия <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеЗначенияПоказателейЭффективностиПозиций.Позиция";
	
	ТаблицаПозиций = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	
	КоличествоПозиций = ТаблицаПозиций.Количество();
	ПоказателейНаОднуПозициюВСреднем =
		?(КоличествоПозиций > 0, ТаблицаПозиций.Итог("КоличествоПоказателей") / КоличествоПозиций, 0);
	
	ПоказателиСтатистики.Вставить("Показателей на одну позицию в среднем", ПоказателейНаОднуПозициюВСреднем);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаСотрудников(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник КАК Сотрудник,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПлановыеЗначенияПоказателейЭффективностиСотрудников.Показатель) КАК КоличествоПоказателей
		|ИЗ
		|	РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников КАК ПлановыеЗначенияПоказателейЭффективностиСотрудников
		|ГДЕ
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия > &НачалоПериода
		|	И ПлановыеЗначенияПоказателейЭффективностиСотрудников.ПериодДействия <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеЗначенияПоказателейЭффективностиСотрудников.Сотрудник";
	
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	
	КоличествоСотрудников = ТаблицаСотрудников.Количество();
	ПоказателейНаОдногоСотрудникаВСреднем =
		?(КоличествоСотрудников > 0, ТаблицаСотрудников.Итог("КоличествоПоказателей") / КоличествоСотрудников, 0);
	
	ПоказателиСтатистики.Вставить("Показателей на одного сотрудника в среднем", ПоказателейНаОдногоСотрудникаВСреднем);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти
